{
    "basics": {
        "name": "Devi Adi Nufriana",
        "label": "Software Engineer",
        "email": "devi.nufriana@gmail.com",
        "phone": "(62) 85642612283",
        "url": "https://deanufriana.github.io",
        "summary": "I am Software Engineer with expertise in React and Vue. Passionate about exploring new technologies to optimize feature development for speed and efficiency. Experienced in rebuilding websites using the latest technologies to enhance performance, maintainability, and code readability. Committed to delivering fast, scalable, and high-quality solutions",
        "location": {
            "address": "Ir. Juanda St",
            "postalCode": "52146",
            "city": "Tegal",
            "countryCode": "ID",
            "region": "South East Asia"
        },
        "profiles": [
            {
                "network": "LinkedIn",
                "username": "devinufriana",
                "url": "https://www.linkedin.com/in/devinufriana"
            }
        ]
    },
    "work": [
        {
            "name": "BRI Life",
            "position": "Software Development",
            "url": "https://brilife.co.id",
            "startDate": "2019-02-01",
            "endDate": "2021-03-01",
            "summary": "Software Engineer with experience in mobile and web development. Led the migration of the 'Mylife' app from React Native to Flutter and managed multiple projects across different technologies. Developed and maintained applications like 'Digiform' using ReactJS and built a customer care app for seamless service access. Skilled in JavaScript, React, ExpressJS, Git, SQL Server, and Linux server configuration, with expertise in deploying applications across environments",
            "highlights": [
                "Spearheaded the transformation of the 'Mylife' mobile application, transitioning it from React Native to Flutter.",
                "Conducted thorough testing and optimization to enhance user experience and app performance.",
                "Successfully managed three distinct application projects, showcasing adaptability across diverse technologies.",
                "Developed a customer care application, ensuring seamless access to vital services.",
                "Contributed significantly to the maintenance and enhancement of the web application 'Digiform' using ReactJS.",
                "Proficiently utilized a versatile tech stack, including JavaScript, ExpressJS, ReactJS, Git, React Native, SQL Server, and Linux server configuration.",
                "Equipped with the skills to configure and deploy applications in various environments, be it development or production."
            ]
        },
        {
            "name": "Glovory",
            "position": "Backend Engineer",
            "url": "https://glovory.solutions/",
            "startDate": "2022-03-01",
            "endDate": "2022-07-01",
            "summary": "Backend Developer with expertise in database implementation, data migration, and API development. Skilled in translating ERD designs into functional SQL databases (MySQL, SQL Server) and optimizing complex queries for efficient data handling. Successfully managed data migrations while ensuring integrity and minimal disruption. Proficient in building robust APIs using Express and NestJS to enable seamless system interactions.",
            "highlights": [
                "Database Implementation Expertise: I translated the ERD design into a functional SQL database, employing MySQL or SQL Server. My experience with complex queries allowed for efficient data retrieval and manipulation.",
                "Efficient Data Migration: I successfully managed the migration of data to the new ERD structure, ensuring data integrity and minimizing disruptions during the transition.",
                "API Development Excellence: Leveraging modern frameworks such as Express or NestJS, I designed and developed robust APIs that powered the project's functionality, ensuring seamless communication and interaction."
            ]
        },
        {
            "name": "Frisidea",
            "position": "Software Development",
            "url": "https://www.frisidea.com/id/",
            "startDate": "2021-04-01",
            "endDate": "2022-07-01",
            "summary": "Software Engineer with experience in mobile and web development. Led the migration of the 'Mylife' app from React Native to Flutter and managed multiple projects across different technologies. Developed and maintained applications like 'Digiform' using ReactJS and built a customer care app for seamless service access. Skilled in JavaScript, React, ExpressJS, Git, SQL Server, and Linux server configuration, with expertise in deploying applications across environments",
            "highlights": [
                "Upgraded the application to utilize the latest React technology stack.",
                "Took on a pivotal role in enhancing the TMLI web application.",
                "Consistently contributed high-quality code and improvements, ensuring optimal performance.",
                "Translated design concepts into a functional and user-friendly web interface.",
                "Adapted the UI/UX of kitasiap.com to align with user preferences and client expectations.",
                "Leveraged HTML, CSS, and JavaScript to create engaging user interactions.",
                "Successfully implemented a web-based customer care access system for the insurance industry.",
                "Ensured seamless user access to policy information and services.",
                "Employed technologies such as JavaScript, ReactJS, ViteJS, Git, Nginx, and Linux to achieve project goals."
            ]
        },
        {
            "name": "Blibli",
            "position": "Software Frontend Development",
            "url": "https://www.blibli.com",
            "startDate": "2022-08-01",
            "summary": "Frontend Engineer with expertise in Vue and UI optimization. Developed integration tests using Playwright to ensure software reliability. Led UI improvements, refactored key pages to the latest Vue version, and migrated the Review Center from Java to Vue for better performance and maintainability. Conducted software analysis to enhance system efficiency and implemented new features based on product requirements.",
            "highlights": [
                "Proficiently developed integration tests using Playwright to validate software functionality and reliability.",
                "Took charge of refining the UI Detail page, implementing improvements for an enhanced user experience.",
                "Conducted comprehensive software analysis to identify opportunities for performance enhancement and implemented strategies to optimize system efficiency.",
                "Refactored the review page, hall of fame page, and latet to the latest Vue version, improving performance and reusability by creating modular components",
                "Redesigned and migrated the Review Center page from Java to Vue, enhancing user experience and modernizing the technology stack",
                "Maintained existing features and developed new functionalities based on product manager requests, ensuring smooth and efficient implementation"
            ]
        }
    ],
    "education": [
        {
            "institution": "Universitas Muhadi Setiabudi",
            "url": "https://umus.ac.id/",
            "area": "Informatics Engineering",
            "studyType": "S1",
            "startDate": "2014-05-01",
            "endDate": "2019-03-01",
            "score": "3.56",
            "courses": []
        }
    ],
    "awards": [],
    "certificates": [
        {
            "name": "Certified Software Engineer",
            "date": "2019-12-12",
            "issuer": "Pijar Camp",
            "url": "https://certificate.com"
        }
    ],
    "publications": [],
    "skills": [
        {
            "name": "Web Development",
            "level": "Master",
            "keywords": [
                "HTML",
                "CSS",
                "Vue",
                "React",
                "Express JS",
                "JavaScript"
            ]
        },
        {
            "name": "Mobile Development",
            "level": "Intermediate",
            "keywords": [
                "React Native",
                "Flutter"
            ]
        },
        {
            "name": "Backend Development",
            "level": "Intermediate",
            "keywords": [
                "Express JS",
                "My SQL"
            ]
        }
    ],
    "languages": [
        {
            "language": "Indonesia",
            "fluency": "Conversation"
        },
        {
            "language": "English",
            "fluency": "Basic"
        }
    ],
    "interests": [],
    "references": [],
    "projects": [
        {
            "name": "Mortgage Loan",
            "startDate": "2018-03-01",
            "endDate": "2019-04-01",
            "description": "",
            "highlights": [],
            "url": "https://simulasi-kpr.vercel.app"
        },
        {
            "name": "Sistem Skripsi",
            "startDate": "2018-03-01",
            "endDate": "2019-04-01",
            "description": "The thesis process becomes more organized and faster, carried out online and can be accessed anywhere via a browser with the aim of saving time, energy and making it easier to obtain information on the thesis process online.",
            "highlights": [],
            "url": "https://github.com/deanufriana/sistem_skripsi"
        }
    ]
}